Repository: dnazirzhanov/Agro3
Catalog: agro3/locale/*/LC_MESSAGES/django.po
Languages: ky

source: Create New Post
ky: Жаңы пост түзүү

source: Agricultural Forum
ky: Айыл чарба форуму

source: Share your agricultural knowledge with the community
ky: Коомчулук менен айыл чарба билимиңизди бөлүшүңүз

source: Title
ky: Аталышы

source: Short Description
ky: Кыскача сүрөттөмө

source: Content
ky: Мазмуну

source: Use the rich text editor to format your content. You can add images, links, lists, and more.
ky: Мазмунуңузду форматтоо үчүн текст редакторун колдонуңуз. Сиз сүрөтчөлөрдү, шилтемелерди, тизмелерди жана башкаларды кошо аласыз.

source: Featured Image
ky: Башкы сүрөт

source: Category
ky: Категория

source: Tags
ky: Тегдер

source: Hold Ctrl/Cmd to select multiple tags
ky: Бир нече тегди тандоо үчүн Ctrl/Cmd басып туруңуз

source: Publish immediately
ky: Дароо жарыялоо

source: Uncheck to save as draft
ky: Долбоор катары сактоо үчүн белгини чечиңиз

source: Cancel
ky: Жокко чыгаруу

source: Create Post
ky: Пост түзүү

source: Share your agricultural knowledge, tips, and experiences...
ky: Айыл чарба билимиңизди, кеңештериңизди жана тажрыйбаңызды бөлүшүңүз...

source: Please add some content to your post.
ky: Постуңузга мазмун кошуңуз.

source: Price Comparison
ky: Баа Салыштыруу

source: Market Prices
ky: Базар Баалары

source: Home
ky: Башкы бет

source: Back to Prices
ky: Баалардын Тизмесине

source: Compare prices for the same product across different markets.
ky: Бир эле товардын баасын ар кандай базарларда салыштырыңыз.

source: Select Product to Compare
ky: Салыштыруу Үчүн Товар Тандаңыз

source: Choose a product...
ky: Товар тандаңыз...

source: Compare Prices
ky: Баа Салыштыруу

source: Comparing
ky: Салыштыруу

source: Showing latest prices from the last 7 days across different markets.
ky: Акыркы 7 күндүн ичиндеги ар кандай базардын эң жаңы баалары.

source: Best Price
ky: Эң Жакшы Баа

source: per unit
ky: бирдик үчүн

source: Updated
ky: Жаңыртылган

source: Read more
ky: Толугу менен окуу

source: Note for
ky: Эскертүү

source: at
ky: базарында

source: Close
ky: Жабуу

source: Price Summary
ky: Баа Жыйынтыгы

source: Market
ky: Базар

source: Location
ky: Жайгашкан Жери

source: Price
ky: Баа

source: Unit
ky: Бирдик

source: Last Updated
ky: Акыркы Жаңыртуу

source: Contact
ky: Байланыш

source: No Recent Price Data Available
ky: Жакынкы Баа Маалыматы Жок

source: No price data found for
ky: Баа маалыматы табылган жок

source: in the last 7 days.
ky: акыркы 7 күндө.

source: Select a Product to Compare
ky: Салыштыруу Үчүн Товар Тандаңыз

source: Choose a product from the dropdown above to compare prices across different markets.
ky: Ар кандай базарлардагы баалардын салыштырмасы үчүн жогорудагы тизмеден товар тандаңыз.

source: Need More Information?
ky: Кошумча Маалымат Керекпи?

source: View Crops
ky: Өсүмдүктөрдү Көрүү

source: All Prices
ky: Бардык Баалар

source: Ask Community
ky: Коомчулуктан Сурануу

source: Stay updated with current market prices across different markets.
ky: Ар түрдүү базардагы учурдагы базар баалары менен тааныш болуп турчу.

source: Price Statistics
ky: Баа Статистикасы

source: Last 30 days
ky: Акыркы 30 күн

source: Average Price
ky: Орточо Баа

source: Lowest Price
ky: Эң Арзан Баа

source: Highest Price
ky: Эң Кымбат Баа

source: Entries
ky: Жазуулар

source: Filter Prices
ky: Баалары Чыпкалоо

source: Search Product
ky: Товар Издөө

source: Enter product name...
ky: Товардын атын киргизиңиз...

source: Product
ky: Товар

source: All Products
ky: Бардык Товарлар

source: All Markets
ky: Бардык Базарлар

source: Time Period
ky: Убакыт Мезгили

source: Filter
ky: Чыпкалоо

source: Clear
ky: Өчүр

source: entries found
ky: жазуу табылды

source: Date
ky: Күнү

source: Notes
ky: Белгилер

source: No price data found
ky: Баа маалыматы табылган жок

source: Try adjusting your search criteria or
ky: Издөө шарттарыңызды өзгөртүп көрүңүз же

source: view all prices
ky: бардык баалар көрүү

source: Price pagination
ky: Баа беттери

source: Previous
ky: Мурунку

source: Next
ky: Кийинки

source: Today
ky: Бүгүн

source: Last 7 days
ky: Акыркык 7 күн

source: Last 3 months
ky: Акыркы 3 ай

source: Dose Calculator
ky: Доза Калькулятору

source: Chemical Dose Calculator
ky: Химиялык Доза Калькулятору

source: How to use:
ky: Кантип колдонуу керек:

source: Enter the recommended dose per liter (usually provided by chemical sellers) and the total volume of water you need to prepare. The calculator will show you the exact amount of chemical needed.
ky: Литрге сунушталган дозаны (адатта химиялык заттарды саткандар тарабынан берилет) жана сиз даярдоого керек болгон суунун жалпы көлөмүн киргизиңиз. Калькулятор керектүү химиялык заттын так өлчөмүн көрсөтөт.

source: Dose per Liter
ky: Литрге Доза

source: e.g., 10
ky: мис., 10

source: grams
ky: грамм

source: Amount of chemical recommended per liter of water
ky: Бир литр сууга сунушталган химиялык заттын саны

source: Total Volume Needed
ky: Керектүү Жалпы Көлөм

source: e.g., 560
ky: мис., 560

source: liters
ky: литр

source: Total volume of solution you need to prepare
ky: Даярдоого керек болгон эритмеден жалпы көлөм

source: Calculate Dose
ky: Дозаны Эсептөө

source: Calculation Result
ky: Эсептөө Жыйынтыгы

source: g
ky: г

source: Total Volume
ky: Жалпы Көлөм

source: L
ky: Л

source: Total Chemical Needed
ky: Керектүү Химиялык Зат

source: kg
ky: кг

source: Quick Reference:
ky: Тез Маалымат:

source: Total needed: %(total_dose)s grams
ky: Жалпы керек: %(total_dose)s грамм

source: This equals: %(total_dose_kg)s kg (%(total_dose)s ÷ 1000)
ky: Бул барабар: %(total_dose_kg)s кг (%(total_dose)s ÷ 1000)

source: Usage Examples
ky: Колдонуу Мисалдары

source: Example 1:
ky: 1-мисал:

source: If the chemical seller recommends <strong>10 grams per liter</strong> and you need <strong>560 liters</strong> of solution:
ky: Эгер химиялык зат сатуучу <strong>бир литрге 10 грамм</strong> сунуштаса жана сизге <strong>560 литр</strong> эритме керек болсо:

source: Result:
ky: Жыйынтык:

source: You need 5,600 grams (5.6 kg) of chemical
ky: Сизге 5,600 грамм (5.6 кг) химиялык зат керек

source: Example 2:
ky: 2-мисал:

source: If the recommendation is <strong>25 grams per liter</strong> and you need <strong>200 liters</strong> of solution:
ky: Эгер сунуш <strong>бир литрге 25 грамм</strong> болсо жана сизге <strong>200 литр</strong> эритме керек болсо:

source: You need 5,000 grams (5 kg) of chemical
ky: Сизге 5,000 грамм (5 кг) химиялык зат керек

source: Safety Tips
ky: Коопсуздук Кеңештери

source: Always wear protective equipment when handling chemicals
ky: Химиялык заттарды колдонуу учурунда ар дайым коргоочу жабдуу кийиңиз

source: Follow the manufacturer's instructions on the chemical label
ky: Химиялык заттын белгисиндеги өндүрүүчүнүн көрсөтмөлөрүн аткарыңыз

source: Mix chemicals in well-ventilated areas
ky: Химиялык заттарды жакшы желдетилген жерлерде аралаштырыңыз

source: Keep chemicals away from children and animals
ky: Химиялык заттарды балдардан жана айбандардан алыс сактаңыз

source: Dispose of empty containers properly
ky: Бош контейнерлерди туура жол менен жок кылыңыз

source: If in doubt, consult with agricultural experts
ky: Эгер күмөнү болсо, айыл чарба адистери менен кеңешиңиз

source: Dosage Calculator
ky: Доза Эсептегич

source: Weather
ky: Аба Ырайы

source: Community
ky: Коомчулук

source: Agro Supplies
ky: Айыл Чарба Жабдуулары

source: Chemical Products
ky: Химиялык Продуктулар

source: Price Calculator
ky: Баа Эсептегич

source: Dashboard
ky: Башкаруу Панели

source: Edit Profile
ky: Профилди Түзөтүү

source: View Profile
ky: Профилди Көрүү

source: Find Farmers
ky: Дыйканчыларды Издөө

source: Admin Panel
ky: Админ Панели

source: Logout
ky: Чыгуу

source: Login
ky: Кируу

source: Register
ky: Катталуу

source: Empowering farmers in Batken region, Kyrgyzstan with data-driven agricultural solutions.
ky: Кыргызстандын Баткен облусундагы дыйканчыларды маалыматтарга негизделген айыл чарба чечимдери менен күчөтүү.

source: Required for password reset and notifications
ky: Сырсөздү калыбына келтирүү жана билдирүүлөр үчүн керек

source: Your first name
ky: Сиздин атыңыз

source: Country
ky: Өлкө

source: Region/State
ky: Аймак/Облус

source: Farmer Type
ky: Фермер түрү

source: Verified Farmer
ky: Текшерилген фермер

source: Profile
ky: Профиль

source: Joined
ky: Кошулган

source: Followers
ky: Жолдоочулар

source: Following
ky: Жолдоо

source: Posts
ky: Посттор

source: Follow
ky: Жолдоо

source: About
ky: Жөнүндө

source: Region
ky: Аймак

source: Experience
ky: Тажрыба

source: Contact Information
ky: Байланыш маалыматы

source: Email
ky: Эл. почта

source: Phone
ky: Телефон

source: No bio provided
ky: Биография көрсөтүлгөн эмес

source: Recent Posts
ky: Акыркы посттор

source: No posts yet.
ky: Азырынча посттор жок.

source: Processing...
ky: Иштетүү...

source: An error occurred
ky: Ката кетти

source: Network error occurred
ky: Тармак катасы кетти

source: Weather Forecast
ky: Аба Ырайы Болжолу

source: Stay informed about weather conditions to make better agricultural decisions.
ky: Айыл чарба чечимдерин туура кабыл алуу үчүн аба ырайы жөнүндө маалыматта болуңуз.

source: Search Location
ky: Жайгашкан Жер Издөө

source: Select Country...
ky: Өлкөнү тандаңыз...

source: Select Region...
ky: Аймакты тандаңыз...

source: City/Village Name
ky: Шаар/Айыл Аталышы

source: Enter city or village name...
ky: Шаар же айылдын атын киргизиңиз...

source: Search
ky: Издөө

source: Or search by city name:
ky: Же шаардын аталышы боюнча издеңиз:

source: Enter city name (e.g., Batken, Bishkek, Osh)
ky: Шаардын аталышын киргизиңиз (мис., Баткен, Бишкек, Ош)

source: Recent locations:
ky: Акыркы жайгашкан жерлер:

source: Weather API Not Configured
ky: Аба Ырайы API Конфигурацияланган Эмес

source: To use weather features, please set your OpenWeatherMap API key in the environment variable
ky: Аба ырайы функцияларын колдонуу үчүн, OpenWeatherMap API ачкычын чөйрө өзгөрмөсүндө орнотуңуз

source: Get a free API key at
ky: Бекер API ачкычын алыңыз

source: Current Weather
ky: Учурдагы Аба Ырайы

source: Feels like
ky: Сезилиши

source: Humidity
ky: Нымдуулук

source: Wind
ky: Шамал

source: Pressure
ky: Басым

source: Visibility
ky: Көрүү Аралыгы

source: 24-Hour Forecast
ky: 24 Саатык Болжол

source: Farming Tips
ky: Фермерчилик Кеңештери

source: Rainy Weather:
ky: Жамгырлуу Аба Ырайы:

source: Good for recently planted crops. Avoid field work and consider covered storage for harvested crops.
ky: Жаңы отургузулган өсүмдүктөр үчүн жакшы. Талаа ишинен качыңыз жана терилген өнүмдү жабык сактоо жайында сактоону ойлонуңуз.

source: Hot Weather:
ky: Ысык Аба Ырайы:

source: Ensure adequate irrigation. Consider early morning or evening work to avoid heat stress.
ky: Жетиштүү сугарууну камсыз кылыңыз. Ысыктан качуу үчүн эртең менен же кечинде иштөөнү ойлонуңуз.

source: Cold Weather:
ky: Суук Аба Ырайы:

source: Protect sensitive crops from frost. Check greenhouse heating systems.
ky: Кыңгыр өсүмдүктөрдү аязdan коргоңуз. Жылуу үйдүн жылытуу системасын текшериңиз.

source: Windy Conditions:
ky: Шамалдуу Аба Ырайы:

source: Secure greenhouses and equipment. Avoid spraying operations.
ky: Жылуу үйлөрдү жана жабдуулардын коопсуздугун камсыз кылыңыз. Чачуу иштеринен качыңыз.

source: Good Conditions:
ky: Жакшы Шарттар:

source: Ideal weather for most agricultural activities.
ky: Көпчүлүк айыл чарба иштери үчүн эң сонун аба ырайы.

source: General Recommendations:
ky: Жалпы Сунуштар:

source: Monitor soil moisture levels regularly
ky: Топуракты нымдуулук деңгээлин дайыма көзөмөлдөө

source: Adjust irrigation based on weather forecast
ky: Аба ырайы болжолуна жараша сугарууну ылайыкташтыруу

source: Plan fieldwork during optimal conditions
ky: Эң сонун шарттарда талаа ишин пландаштыруу

source: Protect equipment from extreme weather
ky: Жабдууларды өтө каткан аба ырайынан коргоо

source: Data Source:
ky: Маалымат Булагы:

source: Last Updated:
ky: Акыркы Жаңыртуу:

source: Location:
ky: Жайгашкан Жери:

source: Coordinates:
ky: Координаттар:

source: Quick Actions:
ky: Тез Аракеттер:

source: Crop Guide
ky: Өсүмдүктөр Колдонмосу

source: No Weather Data Available
ky: Аба Ырайы Маалыматы Жок

source: Please search for a location or check your internet connection.
ky: Жайгашкан жерди издеңиз же интернет байланышыңызды текшериңиз.

source: Enter city/village (e.g., Batken, Osh, Talas...)
ky: Шаар/айыл киргизиңиз (мис., Баткен, Ош, Талас...)

source: Enter city/village (e.g., Almaty, Astana, Shymkent...)
ky: Шаар/айыл киргизиңиз (мис., Алматы, Астана, Шымкент...)

source: Enter city/village (e.g., Dushanbe, Khujand, Kulob...)
ky: Шаар/айыл киргизиңиз (мис., Душанбе, Худжанд, Кулоб...)

source: Enter city/village (e.g., Tashkent, Samarkand, Bukhara...)
ky: Шаар/айыл киргизиңиз (мис., Ташкент, Самарканд, Бухара...)
